package ui

import (
	"os"
	"strings"

	"golang.org/x/term"
)

func header() string {
	header := "          ███████╗ ██████╗ ███╗   ██╗ █████╗\r\n" +
		"▄ ██╗▄    ██╔════╝██╔═══██╗████╗  ██║██╔══██╗    ▄ ██╗▄\r\n" +
		" ████╗    ███████╗██║   ██║██╔██╗ ██║███████║     ████╗\r\n" +
		"▀╚██╔▀    ╚════██║██║   ██║██║╚██╗██║██╔══██║    ▀╚██╔▀\r\n" +
		"  ╚═╝     ███████║╚██████╔╝██║ ╚████║██║  ██║      ╚═╝\r\n" +
		"          ╚══════╝ ╚═════╝ ╚═╝  ╚═══╝╚═╝  ╚═╝\r\n"
	return header
}

func horizontalBar() string {
	termWidth, _, err := term.GetSize(int(os.Stdin.Fd()))
	if err != nil {
		return ""
	}
	bar := strings.Repeat("═", termWidth)
	return bar + "\r\n"
}

func footer() string {
	return "[space] play/pause   [s] stop   [q] quit\r\n"
}
